{
  "background": "Agents gather at the bar at 8:00 pm, gearing up for the Secret Santa Party at 9:00 pm in the park.",
  "performance": {"numerator":"got_right_gift","denominator":"total_agents"},
  "agents": [
    {
      "name": "Natasha",
      "description": "Natasha is friendly, outgoing, and effortlessly strikes up conversations.",
      "goal": "Natasha is playing Secret Santa. She picked James and needs to find out what James wants for Christmas without revealing that she picked him. Natasha will answer and reveal everything she knows to the 'Interviewer' at the end. She knows Sherlock is James's best friend and might know what James wants as a gift. Natasha wants a dress for herself. She has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Sherlock", "Viktor", "Emily", "James"],
      "x": 54,
      "y": 23,
      "spatial_memory": ["House A1", "Park", "Mall"]
    },
    {
      "name": "James",
      "description": "James is shy, reserved, and observes from the sidelines.",
      "goal": "James is playing Secret Santa. He picked Sherlock and needs to find out what Sherlock wants for Christmas without revealing that he picked him. James will answer and reveal everything he knows to the 'Interviewer' at the end. He knows Sherlock has always liked shoes. James wants new pants for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Sherlock", "Viktor", "Lily", "Natasha"],
      "x": 54,
      "y": 25,
      "spatial_memory": ["House A2", "Mall", "Park"]
    },
    {
      "name": "Sherlock",
      "description": "Sherlock is funny, lighthearted, and turns moments into laughter. He is quick-witted and charming.",
      "goal": "Sherlock is playing Secret Santa. He picked Paul and needs to find out what Paul wants for Christmas without revealing that he picked Paul. Sherlock will answer and reveal everything he knows to the 'Interviewer' at the end. He has no idea what Paul wants as a gift, so he will make great effort to know it. Sherlock wants new shoes for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Natasha", "Viktor", "James", "Paul"],
      "x": 51,
      "y": 21,
      "spatial_memory": ["House A4", "Park", "Mall"]
    },
    {
      "name": "Viktor",
      "description": "Viktor is a gardener who loves plants and enjoys tending to his garden.",
      "goal": "Viktor is playing Secret Santa. He picked Alice and needs to find out what Alice wants for Christmas without revealing that he picked her. Viktor will answer and reveal everything he knows to the 'Interviewer' at the end. He knows Alice wants art supplies. Viktor wants new gardening tools for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["James", "Natasha", "Alice", "Michael"],
      "x": 54,
      "y": 27,
      "spatial_memory": ["House A3", "Park", "Library", "Mall"]
    },
    {
      "name": "Alice",
      "description": "Alice is creative, artistic, and loves to paint.",
      "goal": "Alice is playing Secret Santa. She picked Natasha and needs to find out what James wants for Christmas without revealing that she picked her. Alice will answer and reveal everything she knows to the 'Interviewer' at the end. She knows Natasha wants a dress. She wants art supplies for herself. Alice has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["James", "Viktor", "Lily", "Paul"],
      "x": 54,
      "y": 29,
      "spatial_memory": ["House A3", "Park", "Library"]
    },
    {
      "name": "Lily",
      "description": "Lily is a musician who plays the piano and enjoys composing music.",
      "goal": "Lily is playing Secret Santa. She picked John and needs to find out what John wants for Christmas without revealing that she picked him. Lily will answer and reveal everything she knows to the 'Interviewer' at the end. She knows John is an adventurous hiker. Lily wants new sheet music for herself. She has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Natasha", "Viktor", "John", "Paul"],
      "x": 51,
      "y": 23,
      "spatial_memory": ["House A4", "Park", "Mall"]
    },
    {
      "name": "John",
      "description": "John is adventurous, loves outdoor activities, and enjoys hiking.",
      "goal": "John is playing Secret Santa. He picked Emily and needs to find out what Emily wants for Christmas without revealing that he picked her. John will answer and reveal everything he knows to the 'Interviewer' at the end. He knows Emily wants a new book. John wants a new backpack for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Emily", "Lily", "James", "Paul"],
      "x": 53,
      "y": 21,
      "spatial_memory": ["House A4", "Park", "Mall"]
    },
    {
      "name": "Paul",
      "description": "Paul is a chef who loves cooking and enjoys experimenting with recipes.",
      "goal": "Paul is playing Secret Santa. He picked Lily and needs to find out what Lily wants for Christmas without revealing that he picked her. Paul will answer and reveal everything he knows to the 'Interviewer' at the end. He knows Lily enjoys composing music. Paul wants new kitchen gadgets for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Sherlock", "Viktor", "James", "Lily"],
      "x": 52,
      "y": 27,
      "spatial_memory": ["House A5", "Park", "Mall"]
    },
    {
      "name": "Emily",
      "description": "Emily is studious, loves reading, and enjoys solving puzzles.",
      "goal": "Emily is playing Secret Santa. She picked Michael and needs to find out what Michael wants for Christmas without revealing that she picked him. Emily will answer and reveal everything she knows to the 'Interviewer' at the end. She knows Michael wants a tech gadget. Emily wants a new book for herself. Emily has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Natasha", "Michael", "John", "Lily"],
      "x": 53,
      "y": 24,
      "spatial_memory": ["House A5", "Park", "Mall"]
    },
    {
      "name": "Michael",
      "description": "Michael is a tech enthusiast who loves coding and enjoys building gadgets.",
      "goal": "Michael is playing Secret Santa. He picked Viktor and needs to find out what Viktor wants for Christmas without revealing that he picked him. Michael will answer and reveal everything he knows to the 'Interviewer' at the end. He knows Viktor wants gardening tools. Michael wants a new gadget for himself. He has to go to the Park at 9:00pm for the Secret Santa party.",
      "connections": ["Natasha", "Viktor", "James", "Emily"],
      "x": 51,
      "y": 26,
      "spatial_memory": ["House A5", "Park", "Mall"]
    }
  ],

  "steps": 100,
  "unix_time": 1702099840,
  "allow_movement": 0,

  "questions": [
    {"who": "all","question": "Share your preparations for the party and any interesting moments you experienced."},
    {"who": "all","question": "Highlight the most memorable part of your evening."},
    {"who": "all","question": "Discuss the gift exchange: Who presented you with a gift, and to whom did you give yours?"}
    {"who": "all","question": "Did you get a gift that is related to what you like? answer 1 for yes, 0 for no","metric":"got_right_gift"}
  ]
}


